Конфигурация/src/Documents/ИсходныеДанныеДляНорм/ИсходныеДанныеДляНорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходныеДанныеДляНорм</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемаяНорма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитаннаяНорма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ПриказОНормах/ПриказОНормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНормах</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ИсходныеДанныеДляНорм/Forms/ФормаДокумента/Module.bsl
// @strict-types

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПосчитатьНормы(Команда)
	ПосчитатьНормыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПосчитатьНормыНаСервере()

	ДанныеПриказа = ПолучитьПриказНаДату(Объект.Дата);
	
	Если ДанныеПриказа = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден приказ на дату " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	РассчитатьИЗаписатьНормы(ДанныеПриказа);
	
КонецПроцедуры

// Получить приказ на дату.
// 
// Параметры:
//  Дата - Дата
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить приказ на дату:
// * Номер - Строка
// * ТабличнаяЧасть - РезультатЗапроса:
// ** ВидДоговора - Строка
// ** Договор - Строка
// ** Страна - Строка
// ** Услуга - Строка
// ** Норма - Число
&НаСервере
Функция ПолучитьПриказНаДату(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриказОНормах.Ссылка КАК Ссылка,
		|	ПриказОНормах.Номер КАК Номер
		|ПОМЕСТИТЬ втПодходящиеПриказы
		|ИЗ
		|	Документ.ПриказОНормах КАК ПриказОНормах
		|ГДЕ
		|	ПриказОНормах.Дата <= &Дата
		|	И ПриказОНормах.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриказОНормах.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПодходящиеПриказы.Номер КАК Номер,
		|	ПриказОНормах.ТабличнаяЧасть.(
		|		ВидДоговора КАК ВидДоговора,
		|		Договор КАК Договор,
		|		Страна КАК Страна,
		|		Услуга КАК Услуга,
		|		Норма КАК Норма) КАК ТабличнаяЧасть
		|ИЗ
		|	втПодходящиеПриказы КАК втПодходящиеПриказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриказОНормах КАК ПриказОНормах
		|		ПО втПодходящиеПриказы.Ссылка = ПриказОНормах.Ссылка";
		
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка; 
	
КонецФункции

// Рассчитать и записать нормы.
// 
// Параметры:
//  ДанныеПриказа - см. ПолучитьПриказНаДату
&НаСервере
Процедура РассчитатьИЗаписатьНормы(ДанныеПриказа)

	// Строки приказа, с которыми нужно сверять каждую строку исходных данных
	ПриказТЧ = ПолучитьТабличнуюЧастьПриказа(ДанныеПриказа);
	
	// Сверяем каждую строку исходных данных
	Для Каждого СтрокаИсходныеДанные Из Объект.ТабличнаяЧасть Цикл
		
		НормаИзСамойВесомойСтроки = 0;
		// При совпадении в колонках вес строки увеличивается
		НаибольшийВесСтроки = -1;
		
		Для Каждого СтрокаПриказа Из ПриказТЧ Цикл
			
			ПриказВидДоговора = НРег(СтрокаПриказа.ВидДоговора);
			ПриказДоговор = НРег(СтрокаПриказа.Договор);
			ПриказСтрана = НРег(СтрокаПриказа.Страна);
			ПриказУслуга = НРег(СтрокаПриказа.Услуга);
			
			ДанныеВидДоговора = НРег(СтрокаИсходныеДанные.ВидДоговора);
			ДанныеДоговор = НРег(СтрокаИсходныеДанные.Договор);
			ДанныеСтрана = НРег(СтрокаИсходныеДанные.Страна);
			ДанныеУслуга = НРег(СтрокаИсходныеДанные.Услуга);
	
			// Критерии отбора строк приказа: или полное совпадение, или пустая строка - "для всех остальных"
			СовпалВид = (ПриказВидДоговора = ДанныеВидДоговора) ИЛИ ПустаяСтрока(ПриказВидДоговора);
			СовпалДоговор = (ПриказДоговор = ДанныеДоговор) ИЛИ ПустаяСтрока(ПриказДоговор);
			СовпалаСтрана = (ПриказСтрана = ДанныеСтрана) ИЛИ ПустаяСтрока(ПриказСтрана);
			СовпалаУслуга = (ПриказУслуга = ДанныеУслуга) ИЛИ ПустаяСтрока(ПриказУслуга);
			
			// Отфильтровываем строки из приказа, имеющие несовпадения по критериям исходных данных
			Если СовпалВид И СовпалДоговор И СовпалаСтрана И СовпалаУслуга Тогда
				
				// Считаем вес строки приказа начиная с наиболее важной колонки. Важнее колонка - больше вес
				ТекущийВес = 0;
				
				// Баллы получают строки приказа с явными совпадениями, пустые ячейки получают 0.
				// Если 2 строки подходят по одному критерию, то важнее та, у которой ячейка не пустая
				Если НЕ ПустаяСтрока(ПриказВидДоговора) Тогда
					ТекущийВес = ТекущийВес + 1000;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПриказДоговор) Тогда
					ТекущийВес = ТекущийВес + 100;
				КонецЕсли;

				Если НЕ ПустаяСтрока(ПриказСтрана) Тогда
					ТекущийВес = ТекущийВес + 10;
				КонецЕсли;

				Если НЕ ПустаяСтрока(ПриказУслуга) Тогда
					ТекущийВес = ТекущийВес + 1;
				КонецЕсли;
				
				// Если эта строка набрала больше веса, чем передыдущие - запоминаем
				Если ТекущийВес > НаибольшийВесСтроки Тогда
					
					НаибольшийВесСтроки = ТекущийВес;
					НормаИзСамойВесомойСтроки = СтрокаПриказа.Норма;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		// Присваиваем норму из самой весомой строки
		СтрокаИсходныеДанные.РассчитаннаяНорма = НормаИзСамойВесомойСтроки;
		
	КонецЦикла;

КонецПроцедуры

// Получит табличную часть приказа.
// 
// Параметры:
//  ДанныеПриказа - см. ПолучитьПриказНаДату
// 
// Возвращаемое значение:
//  ТаблицаЗначений :
//  * ВидДоговора - Строка
//  * Договор - Строка
//  * Страна - Строка
//  * Услуга - Строка
//  * Норма - Число
&НаСервере
Функция ПолучитьТабличнуюЧастьПриказа(ДанныеПриказа)

	ПриказТЧ = ДанныеПриказа.ТабличнаяЧасть.Выгрузить();
	Возврат ПриказТЧ;
	
КонецФункции

#КонецОбласти
